[NoCoverage] BlockStatement
src/tripService/trip/TripRepository.ts:6:48
 import Trip from "./Trip";
 
 export default class TripRepository {
-    public findTripsByUser(user: User): Trip[] {
-        throw new CollaboratorCallException(
-            "TripDAO should not be invoked on an unit test.");
-    }
+    public findTripsByUser(user: User): Trip[] {}
 }
 

[NoCoverage] StringLiteral
src/tripService/trip/TripRepository.ts:8:13
 export default class TripRepository {
     public findTripsByUser(user: User): Trip[] {
         throw new CollaboratorCallException(
-            "TripDAO should not be invoked on an unit test.");
+            "");
     }
 }
