[NoCoverage] BlockStatement
src/tripService/user/UserSession.ts:5:34
 import User from "./User";
 
 export default class UserSession {
-    public getLoggedUser(): User {
-        throw new CollaboratorCallException(
-            "UserSession.getLoggedUser() should not be called in an unit test",
-        );
-    }
+    public getLoggedUser(): User {}
 }
 
