[Killed] BlockStatement
src/tripService/trip/TripService.ts:18:44
      * @return trips found
      * @throws UserNotLoggedInException
      */
-    public getTripsByUser(u: User): Trip[] {
-        let trips = [];
-        const logged: any = this.userSession.getLoggedUser();
-        let f: boolean = false;
-
-        if (logged != null) {
-            for (const u1 of u.getFriends()) {
-                if (u1 === logged) {
-                    f = true;
-                    break;
-                }
-            }
-
-            if (f) {
-                trips = this.tripRepository.findTripsByUser(u);
-            }
-
-            return trips;
-        } else {
-            throw new UserNotLoggedInException();
-        }
-    }
+    public getTripsByUser(u: User): Trip[] {}
 }
 
killedBy: TripService should throw an error
statusReason: Error: expect(received).toThrow()

Received function did not throw

[Survived] BooleanLiteral
src/tripService/trip/TripService.ts:21:26
     public getTripsByUser(u: User): Trip[] {
         let trips = [];
         const logged: any = this.userSession.getLoggedUser();
-        let f: boolean = false;
+        let f: boolean = true;
 
         if (logged != null) {

[Killed] EqualityOperator
src/tripService/trip/TripService.ts:23:13
         const logged: any = this.userSession.getLoggedUser();
         let f: boolean = false;
 
-        if (logged != null) {
+        if (logged == null) {
             for (const u1 of u.getFriends()) {
                 if (u1 === logged) {
killedBy: TripService should return trips
statusReason: Error:

[Killed] ConditionalExpression
src/tripService/trip/TripService.ts:23:13
         const logged: any = this.userSession.getLoggedUser();
         let f: boolean = false;
 
-        if (logged != null) {
+        if (false) {
             for (const u1 of u.getFriends()) {
                 if (u1 === logged) {
killedBy: TripService should return trips
statusReason: Error:

[Survived] BlockStatement
src/tripService/trip/TripService.ts:24:46
         let f: boolean = false;
 
         if (logged != null) {
-            for (const u1 of u.getFriends()) {
-                if (u1 === logged) {
-                    f = true;
-                    break;
-                }
-            }
+            for (const u1 of u.getFriends()) {}
 
             if (f) {

[Survived] BlockStatement
src/tripService/trip/TripService.ts:25:36
 
         if (logged != null) {
             for (const u1 of u.getFriends()) {
-                if (u1 === logged) {
-                    f = true;
-                    break;
-                }
+                if (u1 === logged) {}
             }
 

[Survived] EqualityOperator
src/tripService/trip/TripService.ts:25:21
 
         if (logged != null) {
             for (const u1 of u.getFriends()) {
-                if (u1 === logged) {
+                if (u1 !== logged) {
                     f = true;
                     break;

[Survived] BooleanLiteral
src/tripService/trip/TripService.ts:26:25
         if (logged != null) {
             for (const u1 of u.getFriends()) {
                 if (u1 === logged) {
-                    f = true;
+                    f = false;
                     break;
                 }

[Survived] ConditionalExpression
src/tripService/trip/TripService.ts:31:17
                 }
             }
 
-            if (f) {
+            if (true) {
                 trips = this.tripRepository.findTripsByUser(u);
             }

[Survived] BlockStatement
src/tripService/trip/TripService.ts:31:20
                 }
             }
 
-            if (f) {
-                trips = this.tripRepository.findTripsByUser(u);
-            }
+            if (f) {}
 
             return trips;

[Killed] BlockStatement
src/tripService/trip/TripService.ts:36:16
             }
 
             return trips;
-        } else {
-            throw new UserNotLoggedInException();
-        }
+        } else {}
     }
 }
killedBy: TripService should throw an error
statusReason: Error: expect(received).toThrow()

Received function did not throw
